---
kind: method
id: M:Autodesk.Revit.DB.Lighting.LightFamily.Dispose
source: html/003c6560-b317-aee4-349a-9a2161c45704.htm
---
# Autodesk.Revit.DB.Lighting.LightFamily.Dispose Method

Releases all resources used by the LightFamily

## Syntax (C#)
```csharp
public void Dispose()
```